ThaoVy1607/MSP430_Ultrasonic_SIM7670C/examples/USS_Water_Demo/USSLibGUIApp/fr6047_USS_app/mathematicsDC/mathematics.c
float mathematics_CalcMedian3of5(const float *fltArray, uint16_t numDataPts)
{
    if (numDataPts != 5)
        return 0.0f;  // Hoặc xử lý lỗi nếu không đúng 5 phần tử

    float copy[5];
	uint16_t i = 0;
    for (; i < 5; i++) {
        copy[i] = fltArray[i];
    }

    qsort(copy, 5, sizeof(float), compare_floats);

    // Lấy trung bình 3 phần tử giữa: copy[1], copy[2], copy[3]
    float medianAvg = (copy[1] + copy[2] + copy[3]) / 3.0f;

    return medianAvg;
}

float mathematics_CalcAverageflt( float * fltArray, uint16_t numDataPts)
{
	double sum = 0.0;
	int i = 0;

	for(i = 0; i < numDataPts; i++)
	{
		sum += (double)fltArray[i];
	}

	return (float) (sum / numDataPts);
}

float mathematics_CalcStDevflt( float * fltArray, float mean, uint16_t numDataPts)
{
	double stdev = 0.0;
	int i = 0;

	for(i = 0; i < numDataPts; i++)
	{
		stdev += ( (double)(fltArray[i] - (double)mean) * (double)(fltArray[i] - (double)mean) );
	}

	stdev = stdev/numDataPts;
	stdev = sqrt(stdev);
	return (float) stdev;
}


#if defined(__TI_COMPILER_VERSION__)
#pragma PERSISTENT(gtempa)
#define __persistent
#elif defined (__IAR_SYSTEMS_ICC__)
#else
#error Compiler not supported!
#endif
__persistent uint32_t gtempa = 0;


#if defined(__TI_COMPILER_VERSION__)
#pragma PERSISTENT(gtempb)
#define __persistent
#elif defined (__IAR_SYSTEMS_ICC__)
#else
#error Compiler not supported!
#endif
__persistent uint32_t gtempb = 0;

#if defined(__TI_COMPILER_VERSION__)
#pragma PERSISTENT(g_minimum)
#define __persistent
#elif defined (__IAR_SYSTEMS_ICC__)
#else
#error Compiler not supported!
#endif
__persistent uint32_t g_minimum = 0;

#if defined(__TI_COMPILER_VERSION__)
#pragma PERSISTENT(g_maximum)
#define __persistent
#elif defined (__IAR_SYSTEMS_ICC__)
#else
#error Compiler not supported!
#endif
__persistent uint32_t g_maximum = 0;

uint32_t mathematics_CalcPercentage(uint32_t min, uint32_t max, uint32_t value)
{
	g_minimum = min;
	g_maximum = max;

	if(value < min)
	{
		value = 0;
		return value;
	}
	else if(value > max)
	{
		value = 100;
		return value;
	}
	else
	{
		gtempa = value - g_minimum;
		gtempb = gtempa * 100;
		value = gtempb / (g_maximum - g_minimum);
		return value;
	}
}

bool mathematics_FloatToString(char * res , float flt, bool* dec, uint8_t numSize)
{
	int intpart;
	float fltpart;
	int fltpartint;
	bool sign = false;

	flt = fabsf(flt);
	// Clear decimal point by default
	dec[4] = false;
    dec[5] = false;
    dec[6] = false;
	dec[7] = false;
    dec[8] = false;
    dec[9] = false;
	res+=4;
	// if( 0 > flt)
	// {
	// 	sign = true;
	// 	flt = flt * (-1);
	// }
	// if((float) ATTOfloat > flt)	// treat as too small to care
	// {
	//     dec[0] = true;
	// 	res[0] = '0';   // display 0.0
	// 	res[1] = '0';
	// 	res[2] = ' ';
	// 	res[3] = ' ';
	// 	res[4] = ' ';
	// 	res[5] = ' ';
	// 	return sign;
	// }

	// else if((float) FEMTOfloat > flt) // treat as atto
	// {
	// 	flt = flt * (float) EXA; res[numSize] = 'A';
	// }
	// else if((float) PICOfloat > flt) // treat as femto
	// {
	// 	flt = flt * (float) PETA; res[numSize] = 'F';
	// }
	// else if((float) NANOfloat > flt) // treat as pico
	// {
	// 	flt = flt * (float) TERA; res[numSize] = 'P';
	// }
	// else if((float) MICROfloat > flt) // treat as nano
	// {
	// 	flt = flt * (float) GIGA; res[numSize] = 'N';
	// }
	// else if((float) MILLIfloat > flt) // treat as micro
	// {
	// 	flt = flt * (float) MEGA; res[numSize] = 'U';
	// }
	// else if ((float) 1 > flt )  	// treat as milli
	// {
	// 	flt = flt * (float) KILO; res[numSize] = 'M';
	// }
	// else if((float) KILO > flt ) // treat as normal
	// {
	// 	res[numSize] = ' ';
	// }
	// else if((float) MEGA > flt ) // treat as kilo
	// {
	// 	flt = flt * (float) MILLIfloat; res[numSize] = 'K';
	// }
	// else if((float) GIGA > flt ) // treat as mega
	// {
	// 	flt = flt * (float) MILLIfloat; res[numSize] = 'M';
	// }
	// else if((float) TERA > flt ) // treat as giga
	// {
	// 	flt = flt * (float) MILLIfloat; res[numSize] = 'G';
	// }
	// else if((float) PETA > flt ) // treat as tera
	// {
	// 	flt = flt * (float) MILLIfloat; res[numSize] = 'T';
	// }
	// else if((float) EXA > flt )	 // treat as peta
	// {
	// 	flt = flt * (float) MILLIfloat; res[numSize] = 'P';
	// }
	// else						// treat as too big to care
	// {
	// 	res[0] = 'O';
	// 	res[1] = 'V';
	// 	res[2] = 'E';
	// 	res[3] = 'R';
	// 	res[4] = ' ';
	// 	res[5] = ' ';
	// 	return sign;
	// }

	// now we have a number 1.000xx to 9.999xx in the desired units.
	if((float) DECA > flt)		// 0.000xx - 9.999xx
	{
		dec[4] = true;
		intpart = (int)flt;
		fltpart = (flt - (float)intpart);
		fltpartint = (int) ( (float) KILO * (float) fltpart * 100.0f);
		mathematics_IntToStr( intpart, res, 1);
		mathematics_IntToStr( fltpartint, res + 1, (numSize - 1));
	}
	else if((float) HECTO > flt)	// 10.00xx - 99.99xx
	{
		dec[5] = true;
		intpart = (int)flt;
		fltpart = flt - (float)intpart;
		fltpartint = (int) ( (float) HECTO * (float) fltpart * 100.0f);
		mathematics_IntToStr( intpart, res, 2);
		mathematics_IntToStr( fltpartint, res + 2, (numSize - 2));
	}
	else						// 100.0xx - 999.9xx
	{
		dec[6] = true;
		intpart = (int)flt;
		fltpart = flt - (float)intpart;
		fltpartint = (int) ( (float) DECA * (float) fltpart * 100.0f);
		mathematics_IntToStr( intpart, res, 3);
		mathematics_IntToStr( fltpartint, res + 3, (numSize - 3));
	}
	return sign;
}

void mathematics_IntToStr(int x, char str[], int d)
{
    int i = 0;
    while (x)
    {
        str[i++] = (x%10) + '0';
        x = x/10;
    }

    // If number of digits required is more, then
    // add 0s at the beginning
    while (i < d)
        str[i++] = '0';

    mathematics_Reverse(str, i);
}

void mathematics_Reverse(char *str, int len)
{
    int i=0, j=len-1, temp;
    while (i<j)
    {
        temp = str[i];
        str[i] = str[j];
        str[j] = temp;
        i++; j--;
    }
}
